podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/TPM1_2CH_POL_MKL82Z7.svd.xml
<!--
Devices using this peripheral:
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "TPM1_2CH_POL_MKL82Z7" ?>
         <name>TPM1</name>
         <description>Timer/PWM Module (2 channels)</description>
         <groupName>TPM</groupName>
         <headerStructName>TPM1</headerStructName>
         <baseAddress>0x40039000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <parameters>
            <parameter> <value>2</value> <name>CONTROLS_COUNT</name> <description>Number of FTM channels</description></parameter>
         </parameters>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x1C</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x50</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x64</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x70</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x78</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x84</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SC</name>
               <description>Status and Control</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>PS</name>
                     <description>Prescale Factor Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>Divide by 1</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Divide by 2</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Divide by 4</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Divide by 8</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>Divide by 16</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>Divide by 32</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>Divide by 64</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>Divide by 128</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMOD</name>
                     <description>Clock Mode Selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>TPM counter clock</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Rising edge of TPM_EXTCLK</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Reserved</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CPWMS</name>
                     <description>Centre-Aligned PWM Select\n
Selects between left and centre-aligned PWM pulse output</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Left-aligned</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Centre-aligned</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOIE</name>
                     <description>Timer Overflow Interrupt Enable\n
An interrupt is generated when TOF equals one</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupts disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupts enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOF</name>
                     <description>Timer Overflow Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not overflowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Overflowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMA</name>
                     <description>DMA Enable for the overflow flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disables DMA transfers</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enables DMA transfers</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <description>Counter</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MOD</name>
               <description>Modulo</description>
               <addressOffset>0x8</addressOffset>
               <resetValue>0xFFFF</resetValue>
               <fields>
                  <field>
                     <name>MOD</name>
                     <description>Modulo Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>$(CONTROLS_COUNT)</dim>
               <dimIncrement>8</dimIncrement>
               <name>CONTROLS,@pC@i@f</name>
               <addressOffset>0xC</addressOffset>
               <register>
                  <name>CnSC</name>
                  <description>Channel %s Status and Control</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>DMA</name>
                        <description>DMA Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Disable DMA transfers</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Enable DMA transfers</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ELS</name>
                        <?ignoreOverlap?>
                        <description>Edge or Level Select\n
Determine edge sensitivity of IC or output action of OC and pulse polarity of PWM\n
Edge sensitivity/Output polarity/Pulse polarity</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b00</name>
                              <description>Inactive</description>
                              <value>0b00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b01</name>
                              <description>Rising/Toggle/Low</description>
                              <value>0b01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b10</name>
                              <description>Falling/Clear/High</description>
                              <value>0b10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b11</name>
                              <description>Either/Set/Low</description>
                              <value>0b11</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ELSA</name>
                        <?hide?>
                        <description>Edge or Level Select A</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ELSB</name>
                        <?hide?>
                        <description>Edge or Level Select B</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MS</name>
                        <?ignoreOverlap?>
                        <description>Channel Mode Select\n
Determines Input Capture, Output Compare &amp; Pulse Width Modulation</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b00</name>
                              <description>Input capture</description>
                              <value>0b00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b01</name>
                              <description>Output compare</description>
                              <value>0b01</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1X</name>
                              <description>Pulse Width Modulation</description>
                              <value>0b1X</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSA</name>
                        <?hide?>
                        <description>Channel Mode Select A</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MSB</name>
                        <?hide?>
                        <description>Channel Mode Select B</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CHIE</name>
                        <description>Channel Interrupt Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Interrupts disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Interrupts enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CHF</name>
                        <description>Channel Flag\nSet when a channel event occurs</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>No channel event</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Channel event</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CnV</name>
                  <description>Channel %s Value</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>VAL</name>
                        <description>Channel Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>STATUS</name>
               <description>Capture and Compare Status</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>STATUS</name>
                     <?ignoreOverlap?>
                     <?hide?>
                     <description>Channel Event Flags\n
These flags are cleared by writting 1.  Writing 0 has no effect.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>CH0F</name>
                     <description>Channel 0 Event Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No event</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Event</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CH0F" > <name>CH1F</name> <description>Channel 1 Event Flag</description> <bitOffset>1</bitOffset> </field>
                  <field>
                     <name>TOF</name>
                     <description>Timer Overflow Flag\n
Indicates if the TPM counter has overflowed</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not overflowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Overflowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMBINE</name>
               <description>Combine Channel Register</description>
               <addressOffset>0x64</addressOffset>
               <fields>
                  <field>
                     <name>COMBINE0</name>
                     <description>Combine Channels 0 and 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Channels 0 and 1 are independent</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Channels 0 and 1 are combined</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COMSWAP0</name>
                     <description>Combine Channel 0 and 1 Swap</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Even channel is used for input capture and 1st compare</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Odd channel is used for input capture and 1st compare</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>POL</name>
               <description>Channel Polarity</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>POL</name>
                     <?ignoreOverlap?>
                     <?hide?>
                     <description>Channel 0 Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>POL0</name>
                     <description>Channel 0 Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The channel polarity is active high</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The channel polarity is active low</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="POL0" > <name>POL1</name> <description>Channel 1 Polarity</description> <bitOffset>1</bitOffset> </field>
               </fields>
            </register>
